Revit 2027 API
IFCLevelInfo.GetRelatedProducts Method
 Gets all building products on this level.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<IFCAnyHandle> GetRelatedProducts()
Public Function GetRelatedProducts As ICollection(Of IFCAnyHandle)
public:
ICollection<IFCAnyHandle^>^ GetRelatedProducts()
member GetRelatedProducts : unit -> ICollection<IFCAnyHandle>
Return Value
ICollection<IFCAnyHandle>
 The collection of products.
See Also
Reference
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace